{
  "architectures": [
    "DroppedLlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attention_gate": true,
  "attention_gate_act": "gumbel_sigmoid",
  "attention_gate_aux_loss_coef": 0.01,
  "attention_gate_target": 10,
  "attention_gate_temperature": 1.0,
  "attention_layers": [
    0,
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    11
  ],
  "bos_token_id": 1,
  "eos_token_id": 2,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "max_position_embeddings": 2048,
  "mlp_bias": false,
  "model_type": "dropped-llama",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "num_key_value_heads": 12,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.46.0",
  "use_cache": true,
  "vocab_size": 32000
}
